Feature: Тестирование Cucumber

  Background: Пользователь находится на главной странице сайта
    Given Открываем сайт "https://demoqa.com/forms"

  Scenario: Пользователь открывает сайт и вводит данные
    When Выбрал пункт меню "Elements"
    And Выбрал вкладку "Text Box"
    And Заполнил поле "Full Name" значением "Иванов Иван Викторович"
    And Заполнил поле "Email" значением "ivanov@hmail.com"
    And Заполнил поле "Current Address" значением "Москва, Проспект мира 16"
    And Заполнил поле "Permanent Address" значением "Москва, Улица Пушкина 7"
    Then Экран оставновился для демонстрации результата в течении 5 секунд
